const keyboard = {
    2: ['а', 'б', 'в', 'г', 'a', 'b', 'c'],
    3: ['д', 'е', 'ё', 'ж', 'з', 'd', 'e', 'f'],
    4: ['и', 'й', 'к', 'л', 'g', 'h', 'i'],
    5: ['м', 'н', 'о', 'п', 'j', 'k', 'l'],
    6: ['р', 'с', 'т', 'у', 'm', 'n', 'o'],
    7: ['ф', 'х', 'ц', 'ч', 'p', 'q', 'r', 's'],
    8: ['ш', 'щ', 'ъ', 'ы', 't', 'u', 'v'],
    9: ['ь', 'э', 'ю', 'я', 'w', 'x', 'y', 'z'],
};

const decipher = (text) => text.split('-').reduce((sum, curr) => sum + keyboard[curr[0]][curr.length - 1], '');

console.log(decipher('22-33-66-5555-33-6-66-5555-33-444-666-4-222-55-9999-444'));
